coba-laravel/routes/web.php

SELECT * FROM `posts` WHERE `posts`.`category_id` = 3 and `posts`.`category_id` IS not NULL
SELECT * FROM `categories`
---
// Mendirect ke method controller untuk menampilkan halaman single post
Route::get('posts/{post:slug}', [PostController::class, 'show']);

Route::get('/categories', function () {
    return view('categories', [
        'title' => 'Post Categories',
        'active' => 'categories',
        'categories' => Category::all()
    ]);
});